

// Step.1 요구사항 구현을 위한 전략

//TODO 메뉴 추가
// - [ ] 메뉴의 이름을 입력받고 확인 버튼을 누르면 메뉴가 추가 된다.
// - [ ] 메뉴의 이름을 입력받고 엔터키 입력으로 추가한다.
// - [ ] 추가되는 메뉴의 마크업은 '<ul id="espresso-menu-list" class="mt-3 pl-0"></ul>' 안에 삽입해야 한다.
// - [ ] 총 메뉴개수를 'count'하여 상단에 보여준다.
// - [ ] 메뉴가 추가되고 나면, input은 빈 값으로 초기화한다.
// - [ ] 사용자 입력값이 빈 값이라면 추가되지 않는다.

//TODO 메뉴 수정
// - [ ] 메뉴의 수정 버튼클릭 이벤트를 받고, 메뉴 이름을 업데이트 한다.
// - [ ] 메뉴 수정시 브라우저에서 제공하는 'prompt' 인터페이스를 활용한다.

//TODO 메뉴 삭제
// - [ ] 메뉴 삭제 버튼을 이용하여 메뉴 삭제할 수 있다. 
// - [ ] 메뉴 수정시 브라우저에서 제공하는 'confirm' 인터페이스를 활용한다.
// - [ ] 총 메뉴개수를 'count'하여 상단에 보여준다.



//요구사항을 분석하여 파트별로 나눠 순서를 정리하여 적어주고 코딩을 시작하는 것이 좋다.